/**
 * Это домашка
 */
//map(): Дан массив чисел. Напишите функцию,которая принимает массив и возвращает новый массив,
// содержащий квадраты каждого числа из исходного массива.
let arr = [1,2,3,4,5,6,7,8,123]
const map1=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//filter(): Дан массив строк. Напишите функцию,
// которая принимает массив и возвращает новый массив,
// содержащий только строки, содержащие более 5 символов.
let strings = ["apple", "banana", "carrot", "date", "elephant", "fig"];
const filter2=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//reduce(): Дан массив чисел. Напишите функцию,
// которая принимает массив и возвращает произведение всех чисел в массиве.
let arr2 = [1,2,3,4,5,6,7,8,123]
const reduce3=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//forEach(): Дан массив объектов. Напишите функцию,
// которая принимает массив и выводит в консоль сообщение, содержащее имя и возраст каждого объекта.
let users = [
    { name: "John", age: 25 },
    { name: "Alice", age: 32 },
    { name: "Bob", age: 40 }
];
const forEach4=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//some(): Дан массив чисел.  Напишите функцию, которая принимает массив и возвращает true,
// если хотя бы одно число является положительным, и false в противном случае.
let numbers = [-2, -5, 0, 10, -8];
const some5=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//every(): Дан массив строк. Напишите функцию, которая принимает массив и возвращает true,
// если все строки начинаются с заглавной буквы, и false в противном случае.
let strings2 = ["Apple", "Banana", "Carrot", "date"];
const every6=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//find(): Дан массив объектов пользователей. Напишите функцию, которая принимает массив и возвращает первого пользователя с именем,
// содержащим определенную подстроку.
let users2 = [
    { name: "John Doe", age: 25 },
    { name: "Alice Smith", age: 32 },
    { name: "Bob Johnson", age: 40 }
];
const find7=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//sort(): Дан массив строк. Напишите функцию,
// которая принимает массив и возвращает новый массив, отсортированный в алфавитном порядке.
let strings3 = ["banana", "apple", "date", "carrot"];
const sort8=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//slice(): Дан массив элементов. Напишите функцию, которая принимает массив и возвращает новый массив,
// содержащий только элементы с индексами от 2 до 5.
let elements = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
const slice9=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//concat(): Даны два массива. Напишите функцию,
// которая принимает два массива и возвращает новый массив, содержащий все элементы из обоих массивов.
let array1 = [1, 2, 3];
let array2 = [4, 5, 6];
const concat10=()=>{

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Те задачки которые решали на занятии
 */
/**
 * Описание задачи: Напишите функцию, которая заполняет новый массив предоставленным значением.
 * Ожидаемый результат: (3, 'a') => ['a', 'a', 'a']
 */
const fill = (arraySize, value) => {
    throw new Error('Напишите здесь свое решение');
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Описание задачи: Напишите функцию, которая разворачивает массив в обратном порядке(без reverse).
 * Ожидаемый результат: [1, 2, 3] => [3, 2, 1]
 */
const reverse = (array) => {
    throw new Error('Напишите здесь свое решение');
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Описание задачи: Напишите функцию, которая очищает массив от нежелательных значений, таких как false, undefined, пустые строки, ноль, null.
 * Ожидаемый результат: [0, 1, false, 2, undefined, '', 3, null] => [1, 2, 3]
 */
const compact = (array) => {
    throw new Error('Напишите здесь свое решение');
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Описание задачи: Напишите функцию, которая возвращает объект, составленный из значений вложенных массивов. Первое значение - ключ, второе - зачение.
 * Ожидаемый результат: [['a', 1], ['b', 2]] => { a: 1, b: 2 }
 */
const fromPairs = (array) => {
    throw new Error('Напишите здесь свое решение');
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Описание задачи: Напишите функцию, возвращает новый массив без предоставленных значений. Используйте примитивные типы.
 * Ожидаемый результат: [1, 2, 3, 1, 2] без 1, 2 => [3]
 */
const without = (array, ...args) => {
    throw new Error('Напишите здесь свое решение');
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Описание задачи: Напишите функцию, которая убирает повторяющиеся значения.
 * Ожидаемый результат: [1, 2, 3, 1, 2] => [1, 2, 3]
 */
const unique = (array) => {
    throw new Error('Напишите здесь свое решение');
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Описание задачи: Напишите функцию, которая сравнивает два массива и возвращает true, если они идентичны.
 * Ожидаемый результат: ([1, 2, 3], [1, 2, 3]) => true
 */
const isEqual = (firstArray, secondArray) => {
    throw new Error('Напишите здесь свое решение');
}


